// программа находит и выводит все простые числа от 2 до 49

#include <stdio.h>

int main() {
    int A[100]; 
    int i, j, a, s, v = 50, m = 50; 
    
    for (i = 0, a = 2; a < v && i < m-1; a++) {   // перебор чисел 
        for (s = 0, j = 0; j < i; j++) {    
            if (a % A[j] == 0) {    
                s = 1;
                break;
            }
        }
        if (s == 0) {
            A[i++] = a;
        }
    }
    
    A[i] = 0;    //последний элемент массива  0 - маркер конца списка
    
    for (i = 0; A[i] != 0; i++) {
        printf("%d ", A[i]);
    }
    
    return 0;
}
